openfoam2206/tutorials/immersedBoundary/CylinderInChannelIco/Turbulent/TurbulentFe41/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | foam-extend: Open Source CFD                    |
|  \\    /   O peration     | Version:     4.1                                |
|   \\  /    A nd           | Web:         http://www.foam-extend.org         |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //


6
(
    ibCylinder
    {
        type            immersedBoundary;
        nFaces          0;
        startFace       134400;

        internalFlow    no;
        isWall          yes;
    }
    in
    {
        type            patch;
        nFaces          150;
        startFace       134400;
    }
    out
    {
        type            patch;
        nFaces          150;
        startFace       134550;
    }
    top
    {
        type            patch;
        nFaces          450;
        startFace       134700;
    }
    bottom
    {
        type            patch;
        nFaces          450;
        startFace       135150;
    }
    frontAndBack
    {
        type            empty;
        inGroups        1(empty);
        nFaces          135000;
        startFace       135600;
    }
)


// ************************************************************************* //
